fixtures/vcr_cassettes/invoice_query_params.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.harvestapp.com/invoices?access_token=htRN5eZXkWqrhGlvrqXNOtnXd8VyMfWw1u/J3zZWRnvb+ffKdj64CiNqHtOLLUJCBgFc7y312kcLzV+TCYkfMQ==&updated_since=2012-10-01%2000:00:00%20UTC
    body:
      encoding: ASCII-8BIT
      string: !binary ""
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Length:
      - '0'
      Content-Type:
      - application/x-www-form-urlencoded
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Oct 2012 20:08:52 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Status:
      - '200'
      X-Powered-By:
      - Phusion Passenger (mod_rails/mod_rack)
      Cache-Control:
      - private, no-store, no-cache, max-age=0, must-revalidate
      X-Frame-Options:
      - SAMEORIGIN
      Access-Control-Allow-Origin:
      - http://localhost:3000
      Access-Control-Expose-Headers:
      - X-Served-From,X-Company-Version,X-Asked-With-Method
      Access-Control-Allow-Headers:
      - Content-Type,Accept
      Etag:
      - ! '"e4582fc9984751640da18e8636c81697"'
      Access-Control-Max-Age:
      - '1200'
      X-Served-From:
      - http://api.harvestapp.com/invoices
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Set-Cookie:
      - _harvest_sess=BAh7BkkiD3Nlc3Npb25faWQGOgZFRiIlZThkZmVmYjMzNjkxYmU0ZWNjYjU5ODFmNThlMDM0NmQ%3D--274548fcb0835ca5c1f708ff2da7d976c610cc6a;
        domain=.harvestapp.com; path=/; HttpOnly
      X-Runtime:
      - '0.314789'
      X-Harvest-Box:
      - rails7
      X-Harvest-Fe:
      - lb4
      X-Harvest-Dc:
      - vxny
    body:
      encoding: US-ASCII
      string: ! '[{"invoices":{"amount":"435.5","client_id":1267814,"client_key":"6bb410f9b9ba576f777cdc18a4f6a03d44719d35","created_at":"2012-10-28T04:06:28Z","created_by_id":null,"currency":"United
        States Dollars - USD","discount":null,"discount_amount":"0.0","due_amount":"435.5","due_at":"2012-11-27","due_at_human_format":"net
        30","estimate_id":null,"id":1977776,"issued_at":"2012-10-28","notes":"","number":"123","period_end":null,"period_start":null,"purchase_order":"","recurring_invoice_id":46928,"retainer_id":null,"state":"draft","subject":"","tax":"8.875","tax2":null,"tax2_amount":"0.0","tax_amount":"35.5","updated_at":"2012-10-28T04:06:28Z"}},{"invoices":{"amount":"435.5","client_id":1267814,"client_key":"120dd3e7c0294f0e9e104d78f77bdf758141c88a","created_at":"2012-10-21T04:05:45Z","created_by_id":null,"currency":"United
        States Dollars - USD","discount":null,"discount_amount":"0.0","due_amount":"435.5","due_at":"2012-11-20","due_at_human_format":"net
        30","estimate_id":null,"id":1956321,"issued_at":"2012-10-21","notes":"","number":"122","period_end":null,"period_start":null,"purchase_order":"","recurring_invoice_id":46928,"retainer_id":null,"state":"draft","subject":"","tax":"8.875","tax2":null,"tax2_amount":"0.0","tax_amount":"35.5","updated_at":"2012-10-21T04:05:45Z"}},{"invoices":{"amount":"75.0","client_id":1268631,"client_key":"ed75ce2ab995d7efcfd520c8ea47126d5d9f7eeb","created_at":"2012-10-18T04:36:29Z","created_by_id":402196,"currency":"United
        States Dollars - USD","discount":null,"discount_amount":"0.0","due_amount":"75.0","due_at":"2012-11-17","due_at_human_format":"net
        30","estimate_id":null,"id":1948436,"issued_at":"2012-10-18","notes":"","number":"121","period_end":null,"period_start":null,"purchase_order":"","recurring_invoice_id":null,"retainer_id":null,"state":"open","subject":"","tax":"8.875","tax2":null,"tax2_amount":"0.0","tax_amount":"0.0","updated_at":"2012-10-18T04:36:46Z"}},{"invoices":{"amount":"136.09","client_id":1267878,"client_key":"f19c59f4e636bfe965b82c8d0516cf332377c131","created_at":"2012-10-16T23:00:09Z","created_by_id":402196,"currency":"United
        States Dollars - USD","discount":null,"discount_amount":"0.0","due_amount":"136.09","due_at":"2012-10-31","due_at_human_format":"net
        15","estimate_id":null,"id":1944426,"issued_at":"2012-10-16","notes":"","number":"120","period_end":null,"period_start":null,"purchase_order":"","recurring_invoice_id":null,"retainer_id":null,"state":"open","subject":"","tax":"8.875","tax2":null,"tax2_amount":"0.0","tax_amount":"11.09","updated_at":"2012-10-16T23:00:55Z"}},{"invoices":{"amount":"435.5","client_id":1267814,"client_key":"633e8ad443e616459a26b877372537c38314c0e6","created_at":"2012-10-14T04:06:01Z","created_by_id":null,"currency":"United
        States Dollars - USD","discount":null,"discount_amount":"0.0","due_amount":"435.5","due_at":"2012-11-13","due_at_human_format":"net
        30","estimate_id":null,"id":1935740,"issued_at":"2012-10-14","notes":"","number":"119","period_end":null,"period_start":null,"purchase_order":"","recurring_invoice_id":46928,"retainer_id":null,"state":"draft","subject":"","tax":"8.875","tax2":null,"tax2_amount":"0.0","tax_amount":"35.5","updated_at":"2012-10-14T04:06:01Z"}},{"invoices":{"amount":"435.5","client_id":1267814,"client_key":"2ea29c3fa9bdd071e3f219bc55b7b9971c09f9b8","created_at":"2012-10-07T04:07:22Z","created_by_id":null,"currency":"United
        States Dollars - USD","discount":null,"discount_amount":"0.0","due_amount":"435.5","due_at":"2012-11-06","due_at_human_format":"net
        30","estimate_id":null,"id":1918377,"issued_at":"2012-10-07","notes":"","number":"118","period_end":null,"period_start":null,"purchase_order":"","recurring_invoice_id":46928,"retainer_id":null,"state":"draft","subject":"","tax":"8.875","tax2":null,"tax2_amount":"0.0","tax_amount":"35.5","updated_at":"2012-10-07T04:07:22Z"}},{"invoices":{"amount":"217.75","client_id":1267869,"client_key":"007d10e717cd066cfc78ab1637f6e9e3b352c63f","created_at":"2012-09-29T23:12:33Z","created_by_id":402196,"currency":"United
        States Dollars - USD","discount":null,"discount_amount":"0.0","due_amount":"0.0","due_at":"2012-10-27","due_at_human_format":"net
        30","estimate_id":null,"id":1882172,"issued_at":"2012-09-27","notes":"","number":"108","period_end":null,"period_start":null,"purchase_order":"","recurring_invoice_id":null,"retainer_id":null,"state":"paid","subject":"","tax":"8.875","tax2":null,"tax2_amount":"0.0","tax_amount":"17.75","updated_at":"2012-10-18T04:35:14Z"}},{"invoices":{"amount":"653.25","client_id":1267860,"client_key":"2b27b5e2d4751b92c00f45f24ee53da6dd2df982","created_at":"2012-09-29T22:53:18Z","created_by_id":402196,"currency":"United
        States Dollars - USD","discount":null,"discount_amount":"0.0","due_amount":"0.0","due_at":"2012-09-19","due_at_human_format":"net
        15","estimate_id":null,"id":1882092,"issued_at":"2012-09-04","notes":"","number":"101","period_end":null,"period_start":null,"purchase_order":"","recurring_invoice_id":null,"retainer_id":null,"state":"paid","subject":"","tax":"8.875","tax2":null,"tax2_amount":"0.0","tax_amount":"53.25","updated_at":"2012-10-16T23:01:32Z"}}]'
    http_version: 
  recorded_at: Mon, 29 Oct 2012 20:09:04 GMT
recorded_with: VCR 2.2.5
